<h2><b>Pandas</b></h2><br>
Open source python package providing fast, flexible and expressive data structures designed to make working with “relational” or “labeled” data both easy and intuitive.

In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

Two key data structures were introduced to Python by Pandas, both of which are essentially built on top of NumPy and inherits its fast performance<br>
<ul>
    <li>Series</li>
    <li>Data Frames</li>
</ul>

<h3><b>Series</b><br></h3>
This is 1-dimensional object similar to column in a spreadsheet or SQL table.By default each item will be assigned a index label from 0 to N.

In [2]:
s = pd.Series([1,2,3,np.nan,5,6], index=['A','B','C','D','E','F'])
print(s)

A    1.0
B    2.0
C    3.0
D    NaN
E    5.0
F    6.0
dtype: float64

In [3]:
#index can be duplicate
s = pd.Series([1,2,3,np.nan,5,6], index=['A','C','C','D','E','F'])
print(s)

A    1.0
C    2.0
C    3.0
D    NaN
E    5.0
F    6.0
dtype: float64

In [5]:
#series using dictionary
sample_dict = {'A':1 , 'B':2 , 'C':3 , 'D':np.nan, 'E':5 ,'F':6}#index can't be duplicate
sample_dict
s1 = pd.Series(sample_dict)
print(s1)

A    1.0
B    2.0
C    3.0
D    NaN
E    5.0
F    6.0
dtype: float64

<b>Data Frames</b><br>
It is 2-D object similar to spreadsheet or SQL table.This is most commonly used panda objects.

In [6]:
data ={'Gender':['f','m','m'],
       'emp_id':['e01','e02','e03'],
       'age':[25,27,25]}
df = pd.DataFrame(data, columns=['emp_id','Gender','age'])
#we can reorder the columns

In [7]:
df

  emp_id Gender  age
0    e01      f   25
1    e02      m   27
2    e03      m   25

<h3><b>Reading and Writing Data</b></h3><br>
3 commonly used file formats under reading and writing <br>
<ul>
<li>.csv</li>
<li>.txt</li>
<li>Excel</li>
</ul>
Note : Write will overwrite any file existing file with the same name.

In [8]:
#from csv
df = pd.read_csv('filename.csv')
#to csv ,index = False will not write the row numbers
df.to_csv('filenamenew.csv', index=False)

FileNotFoundError: [Errno 2] File filename.csv does not exist: 'filename.csv'

In [9]:
type(df)

pandas.core.frame.DataFrame

<h3><b>Download Data</b></h3><br>
using wget

<b>Reading Text Files</b><br>
One way to read or write a file in Python is to use the built-in open function. The open function provides a File object that contains the methods and attributes you need in order to read, save, and manipulate the file.

In [16]:
#read the file
eg = r"C:\Users\Stuti Singh\Desktop\readfile.txt"
file1 = open(eg, "r")

In [17]:
#print file pathe
file1.name

'C:\\Users\\Stuti Singh\\Desktop\\readfile.txt'

In [18]:
#print mode of file, either 'r' or  'w'
file1.mode

'r'

In [19]:
#read the file
filecontent = file1.read()
filecontent

'red\nyellow\npink \norange\nblack\ngrey\ngreen'

In [20]:
#close the file
file1.close()

<h3><b>Better way to open file</b></h3>

In [21]:
with open(r"C:\Users\Stuti Singh\Desktop\readfile.txt","r") as file1:
    filecontent = file1.read()
print(filecontent)

red
yellow
pink
orange
black
grey
green

In [22]:
#read first 4 characters
with open(r"C:\Users\Stuti Singh\Desktop\readfile.txt","r") as file1:
    print(file1.read(4))

red

In [23]:
with open(r"C:\Users\Stuti Singh\Desktop\readfile.txt","r") as file1:
    print(file1.read(4))
    print(file1.read(4))
    print(file1.read(7))
    print(file1.read(15))

red

yell
ow
pink

orange
black

In [25]:
#read one line
with open(r"C:\Users\Stuti Singh\Desktop\readfile.txt","r") as file1:
    print("first line " + file1.readline())

first line red

In [26]:
# Iterate through lines
with open(r"C:\Users\Stuti Singh\Desktop\readfile.txt","r") as file1:
    i = 0
    for line in file1:
        print("iterations", str(i),':',line)

iterations 0 : red

iterations 0 : yellow

iterations 0 : pink

iterations 0 : orange

iterations 0 : black

iterations 0 : grey

iterations 0 : green

In [28]:
#read all lines and save as list
with open(r"C:\Users\Stuti Singh\Desktop\readfile.txt","r") as file1:
    fileaslist = file1.readlines()

In [29]:
#print first line
fileaslist[0]

'red\n'

In [30]:
#print second line
fileaslist[1]

'yellow\n'

In [31]:
#print third line
fileaslist[2]

'pink \n'

<h3><b>Copy a File</b></h3>

In [ ]:
# copy file to another
with open(r"C:\Users\Stuti Singh\Desktop\readfile.txt","r") as readfile:
    with open("Example.txt",'w') as writefile:
        for line in readfile:#reading each line and writing those lines in 2nd file
            writefile.write(line)

<h3><b>Basic Statistics on DataFrame</b></h3><br>
describe() - will return the quick stats such as count, mean, std, min, first quartile, median, third quartile, max on each columns of the DataFrame.

In [4]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
df = pd.read_csv(r"C:\Users\Stuti Singh\Downloads\tableconvert_csv_abbyek.csv")
df.describe()

       sepal.length  sepal.width  petal.length  petal.width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

<h3><b>Covariance</b></h3><br>
Positive <br>
Negative<br>
A positive covariance number between two variables means that they are positively related, while a negative covariance number means the variables are inversely related. The key drawback of covariance is that it does explain us the degree of positive or negative relation between variables.

In [5]:
df.cov()

              sepal.length  sepal.width  petal.length  petal.width
sepal.length      0.685694    -0.042434      1.274315     0.516271
sepal.width      -0.042434     0.189979     -0.329656    -0.121639
petal.length      1.274315    -0.329656      3.116278     1.295609
petal.width       0.516271    -0.121639      1.295609     0.581006

<h3><b>Correlation</b></h3><br>
tells whether variables are positively or negatively related. also nuber tells us degree to which the variables tend to move together.<br>
Correlation always ranges between -1 and 1.

In [6]:
df.corr()

              sepal.length  sepal.width  petal.length  petal.width
sepal.length      1.000000    -0.117570      0.871754     0.817941
sepal.width      -0.117570     1.000000     -0.428440    -0.366126
petal.length      0.871754    -0.428440      1.000000     0.962865
petal.width       0.817941    -0.366126      0.962865     1.000000

<h3><b>Viewing Data</b></h3>

In [7]:
#looking at top n records
#view 1st 2 rows. if n not specified the default value is 5.
df.head()

   sepal.length  sepal.width  petal.length  petal.width variety
0           5.1          3.5           1.4          0.2  Setosa
1           4.9          3.0           1.4          0.2  Setosa
2           4.7          3.2           1.3          0.2  Setosa
3           4.6          3.1           1.5          0.2  Setosa
4           5.0          3.6           1.4          0.2  Setosa

In [8]:
df.head(n=2)

   sepal.length  sepal.width  petal.length  petal.width variety
0           5.1          3.5           1.4          0.2  Setosa
1           4.9          3.0           1.4          0.2  Setosa

In [9]:
df.head(n=12)

    sepal.length  sepal.width  petal.length  petal.width variety
0            5.1          3.5           1.4          0.2  Setosa
1            4.9          3.0           1.4          0.2  Setosa
2            4.7          3.2           1.3          0.2  Setosa
3            4.6          3.1           1.5          0.2  Setosa
4            5.0          3.6           1.4          0.2  Setosa
5            5.4          3.9           1.7          0.4  Setosa
6            4.6          3.4           1.4          0.3  Setosa
7            5.0          3.4           1.5          0.2  Setosa
8            4.4          2.9           1.4          0.2  Setosa
9            4.9          3.1           1.5          0.1  Setosa
10           5.4          3.7           1.5          0.2  Setosa
11           4.8          3.4           1.6          0.2  Setosa

In [10]:
#looking at bottom n records
df.tail()

     sepal.length  sepal.width  petal.length  petal.width    variety
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

In [11]:
#for every column what is the data type
df.dtypes

sepal.length    float64
sepal.width     float64
petal.length    float64
petal.width     float64
variety          object
dtype: object

In [12]:
print("Column names", df.columns)

Column names Index(['sepal.length', 'sepal.width', 'petal.length', 'petal.width',
       'variety'],
      dtype='object')

In [13]:
print(df.index)

RangeIndex(start=0, stop=150, step=1)

In [16]:
#Get dataframe values only
print(df["sepal.length"].values)
print(df.values)

[5.1 4.9 4.7 4.6 5.  5.4 4.6 5.  4.4 4.9 5.4 4.8 4.8 4.3 5.8 5.7 5.4 5.1
 5.7 5.1 5.4 5.1 4.6 5.1 4.8 5.  5.  5.2 5.2 4.7 4.8 5.4 5.2 5.5 4.9 5.
 5.5 4.9 4.4 5.1 5.  4.5 4.4 5.  5.1 4.8 5.1 4.6 5.3 5.  7.  6.4 6.9 5.5
 6.5 5.7 6.3 4.9 6.6 5.2 5.  5.9 6.  6.1 5.6 6.7 5.6 5.8 6.2 5.6 5.9 6.1
 6.3 6.1 6.4 6.6 6.8 6.7 6.  5.7 5.5 5.5 5.8 6.  5.4 6.  6.7 6.3 5.6 5.5
 5.5 6.1 5.8 5.  5.6 5.7 5.7 6.2 5.1 5.7 6.3 5.8 7.1 6.3 6.5 7.6 4.9 7.3
 6.7 7.2 6.5 6.4 6.8 5.7 5.8 6.4 6.5 7.7 7.7 6.  6.9 5.6 7.7 6.3 6.7 7.2
 6.2 6.1 6.4 7.2 7.4 7.9 6.4 6.3 6.1 7.7 6.3 6.4 6.  6.9 6.7 6.9 5.8 6.8
 6.7 6.7 6.3 6.5 6.2 5.9]
[[5.1 3.5 1.4 0.2 'Setosa']
 [4.9 3.0 1.4 0.2 'Setosa']
 [4.7 3.2 1.3 0.2 'Setosa']
 [4.6 3.1 1.5 0.2 'Setosa']
 [5.0 3.6 1.4 0.2 'Setosa']
 [5.4 3.9 1.7 0.4 'Setosa']
 [4.6 3.4 1.4 0.3 'Setosa']
 [5.0 3.4 1.5 0.2 'Setosa']
 [4.4 2.9 1.4 0.2 'Setosa']
 [4.9 3.1 1.5 0.1 'Setosa']
 [5.4 3.7 1.5 0.2 'Setosa']
 [4.8 3.4 1.6 0.2 'Setosa']
 [4.8 3.0 1.4 0.1 'Setosa']
 [4.3 3.0 1.1 0.1 'Setosa']
 [5.8 4.0 1.2 0.2 'Setosa']
 [5.7 4.4 1.5 0.4 'Setosa']
 [5.4 3.9 1.3 0.4 'Setosa']
 [5.1 3.5 1.4 0.3 'Setosa']
 [5.7 3.8 1.7 0.3 'Setosa']
 [5.1 3.8 1.5 0.3 'Setosa']
 [5.4 3.4 1.7 0.2 'Setosa']
 [5.1 3.7 1.5 0.4 'Setosa']
 [4.6 3.6 1.0 0.2 'Setosa']
 [5.1 3.3 1.7 0.5 'Setosa']
 [4.8 3.4 1.9 0.2 'Setosa']
 [5.0 3.0 1.6 0.2 'Setosa']
 [5.0 3.4 1.6 0.4 'Setosa']
 [5.2 3.5 1.5 0.2 'Setosa']
 [5.2 3.4 1.4 0.2 'Setosa']
 [4.7 3.2 1.6 0.2 'Setosa']
 [4.8 3.1 1.6 0.2 'Setosa']
 [5.4 3.4 1.5 0.4 'Setosa']
 [5.2 4.1 1.5 0.1 'Setosa']
 [5.5 4.2 1.4 0.2 'Setosa']
 [4.9 3.1 1.5 0.2 'Setosa']
 [5.0 3.2 1.2 0.2 'Setosa']
 [5.5 3.5 1.3 0.2 'Setosa']
 [4.9 3.6 1.4 0.1 'Setosa']
 [4.4 3.0 1.3 0.2 'Setosa']
 [5.1 3.4 1.5 0.2 'Setosa']
 [5.0 3.5 1.3 0.3 'Setosa']
 [4.5 2.3 1.3 0.3 'Setosa']
 [4.4 3.2 1.3 0.2 'Setosa']
 [5.0 3.5 1.6 0.6 'Setosa']
 [5.1 3.8 1.9 0.4 'Setosa']
 [4.8 3.0 1.4 0.3 'Setosa']
 [5.1 3.8 1.6 0.2 'Setosa']
 [4.6 3.2 1.4 0.2 'Setosa']
 [5.3 3.7 1.5 0.2 'Setosa']
 [5.0 3.3 1.4 0.2 'Setosa']
 [7.0 3.2 4.7 1.4 'Versicolor']
 [6.4 3.2 4.5 1.5 'Versicolor']
 [6.9 3.1 4.9 1.5 'Versicolor']
 [5.5 2.3 4.0 1.3 'Versicolor']
 [6.5 2.8 4.6 1.5 'Versicolor']
 [5.7 2.8 4.5 1.3 'Versicolor']
 [6.3 3.3 4.7 1.6 'Versicolor']
 [4.9 2.4 3.3 1.0 'Versicolor']
 [6.6 2.9 4.6 1.3 'Versicolor']
 [5.2 2.7 3.9 1.4 'Versicolor']
 [5.0 2.0 3.5 1.0 'Versicolor']
 [5.9 3.0 4.2 1.5 'Versicolor']
 [6.0 2.2 4.0 1.0 'Versicolor']
 [6.1 2.9 4.7 1.4 'Versicolor']
 [5.6 2.9 3.6 1.3 'Versicolor']
 [6.7 3.1 4.4 1.4 'Versicolor']
 [5.6 3.0 4.5 1.5 'Versicolor']
 [5.8 2.7 4.1 1.0 'Versicolor']
 [6.2 2.2 4.5 1.5 'Versicolor']
 [5.6 2.5 3.9 1.1 'Versicolor']
 [5.9 3.2 4.8 1.8 'Versicolor']
 [6.1 2.8 4.0 1.3 'Versicolor']
 [6.3 2.5 4.9 1.5 'Versicolor']
 [6.1 2.8 4.7 1.2 'Versicolor']
 [6.4 2.9 4.3 1.3 'Versicolor']
 [6.6 3.0 4.4 1.4 'Versicolor']
 [6.8 2.8 4.8 1.4 'Versicolor']
 [6.7 3.0 5.0 1.7 'Versicolor']
 [6.0 2.9 4.5 1.5 'Versicolor']
 [5.7 2.6 3.5 1.0 'Versicolor']
 [5.5 2.4 3.8 1.1 'Versicolor']
 [5.5 2.4 3.7 1.0 'Versicolor']
 [5.8 2.7 3.9 1.2 'Versicolor']
 [6.0 2.7 5.1 1.6 'Versicolor']
 [5.4 3.0 4.5 1.5 'Versicolor']
 [6.0 3.4 4.5 1.6 'Versicolor']
 [6.7 3.1 4.7 1.5 'Versicolor']
 [6.3 2.3 4.4 1.3 'Versicolor']
 [5.6 3.0 4.1 1.3 'Versicolor']
 [5.5 2.5 4.0 1.3 'Versicolor']
 [5.5 2.6 4.4 1.2 'Versicolor']
 [6.1 3.0 4.6 1.4 'Versicolor']
 [5.8 2.6 4.0 1.2 'Versicolor']
 [5.0 2.3 3.3 1.0 'Versicolor']
 [5.6 2.7 4.2 1.3 'Versicolor']
 [5.7 3.0 4.2 1.2 'Versicolor']
 [5.7 2.9 4.2 1.3 'Versicolor']
 [6.2 2.9 4.3 1.3 'Versicolor']
 [5.1 2.5 3.0 1.1 'Versicolor']
 [5.7 2.8 4.1 1.3 'Versicolor']
 [6.3 3.3 6.0 2.5 'Virginica']
 [5.8 2.7 5.1 1.9 'Virginica']
 [7.1 3.0 5.9 2.1 'Virginica']
 [6.3 2.9 5.6 1.8 'Virginica']
 [6.5 3.0 5.8 2.2 'Virginica']
 [7.6 3.0 6.6 2.1 'Virginica']
 [4.9 2.5 4.5 1.7 'Virginica']
 [7.3 2.9 6.3 1.8 'Virginica']
 [6.7 2.5 5.8 1.8 'Virginica']
 [7.2 3.6 6.1 2.5 'Virginica']
 [6.5 3.2 5.1 2.0 'Virginica']
 [6.4 2.7 5.3 1.9 'Virginica']
 [6.8 3.0 5.5 2.1 'Virginica']
 [5.7 2.5 5.0 2.0 'Virginica']
 [5.8 2.8 5.1 2.4 'Virginica']
 [6.4 3.2 5.3 2.3 'Virginica']
 [6.5 3.0 5.5 1.8 'Virginica']
 [7.7 3.8 6.7 2.2 'Virginica']
 [7.7 2.6 6.9 2.3 'Virginica']
 [6.0 2.2 5.0 1.5 'Virginica']
 [6.9 3.2 5.7 2.3 'Virginica']
 [5.6 2.8 4.9 2.0 'Virginica']
 [7.7 2.8 6.7 2.0 'Virginica']
 [6.3 2.7 4.9 1.8 'Virginica']
 [6.7 3.3 5.7 2.1 'Virginica']
 [7.2 3.2 6.0 1.8 'Virginica']
 [6.2 2.8 4.8 1.8 'Virginica']
 [6.1 3.0 4.9 1.8 'Virginica']
 [6.4 2.8 5.6 2.1 'Virginica']
 [7.2 3.0 5.8 1.6 'Virginica']
 [7.4 2.8 6.1 1.9 'Virginica']
 [7.9 3.8 6.4 2.0 'Virginica']
 [6.4 2.8 5.6 2.2 'Virginica']
 [6.3 2.8 5.1 1.5 'Virginica']
 [6.1 2.6 5.6 1.4 'Virginica']
 [7.7 3.0 6.1 2.3 'Virginica']
 [6.3 3.4 5.6 2.4 'Virginica']
 [6.4 3.1 5.5 1.8 'Virginica']
 [6.0 3.0 4.8 1.8 'Virginica']
 [6.9 3.1 5.4 2.1 'Virginica']
 [6.7 3.1 5.6 2.4 'Virginica']
 [6.9 3.1 5.1 2.3 'Virginica']
 [5.8 2.7 5.1 1.9 'Virginica']
 [6.8 3.2 5.9 2.3 'Virginica']
 [6.7 3.3 5.7 2.5 'Virginica']
 [6.7 3.0 5.2 2.3 'Virginica']
 [6.3 2.5 5.0 1.9 'Virginica']
 [6.5 3.0 5.2 2.0 'Virginica']
 [6.2 3.4 5.4 2.3 'Virginica']
 [5.9 3.0 5.1 1.8 'Virginica']]

In [17]:
df['variety']

0         Setosa
1         Setosa
2         Setosa
3         Setosa
4         Setosa
         ...
145    Virginica
146    Virginica
147    Virginica
148    Virginica
149    Virginica
Name: variety, Length: 150, dtype: object

In [18]:
df['variety'].values

array(['Setosa', 'Setosa', 'Setosa', 'Setosa', 'Setosa', 'Setosa',
       'Setosa', 'Setosa', 'Setosa', 'Setosa', 'Setosa', 'Setosa',
       'Setosa', 'Setosa', 'Setosa', 'Setosa', 'Setosa', 'Setosa',
       'Setosa', 'Setosa', 'Setosa', 'Setosa', 'Setosa', 'Setosa',
       'Setosa', 'Setosa', 'Setosa', 'Setosa', 'Setosa', 'Setosa',
       'Setosa', 'Setosa', 'Setosa', 'Setosa', 'Setosa', 'Setosa',
       'Setosa', 'Setosa', 'Setosa', 'Setosa', 'Setosa', 'Setosa',
       'Setosa', 'Setosa', 'Setosa', 'Setosa', 'Setosa', 'Setosa',
       'Setosa', 'Setosa', 'Versicolor', 'Versicolor', 'Versicolor',
       'Versicolor', 'Versicolor', 'Versicolor', 'Versicolor',
       'Versicolor', 'Versicolor', 'Versicolor', 'Versicolor',
       'Versicolor', 'Versicolor', 'Versicolor', 'Versicolor',
       'Versicolor', 'Versicolor', 'Versicolor', 'Versicolor',
       'Versicolor', 'Versicolor', 'Versicolor', 'Versicolor',
       'Versicolor', 'Versicolor', 'Versicolor', 'Versicolor',
       'Versicolor', 'Versicolor', 'Versicolor', 'Versicolor',
       'Versicolor', 'Versicolor', 'Versicolor', 'Versicolor',
       'Versicolor', 'Versicolor', 'Versicolor', 'Versicolor',
       'Versicolor', 'Versicolor', 'Versicolor', 'Versicolor',
       'Versicolor', 'Versicolor', 'Versicolor', 'Versicolor',
       'Versicolor', 'Versicolor', 'Versicolor', 'Virginica', 'Virginica',
       'Virginica', 'Virginica', 'Virginica', 'Virginica', 'Virginica',
       'Virginica', 'Virginica', 'Virginica', 'Virginica', 'Virginica',
       'Virginica', 'Virginica', 'Virginica', 'Virginica', 'Virginica',
       'Virginica', 'Virginica', 'Virginica', 'Virginica', 'Virginica',
       'Virginica', 'Virginica', 'Virginica', 'Virginica', 'Virginica',
       'Virginica', 'Virginica', 'Virginica', 'Virginica', 'Virginica',
       'Virginica', 'Virginica', 'Virginica', 'Virginica', 'Virginica',
       'Virginica', 'Virginica', 'Virginica', 'Virginica', 'Virginica',
       'Virginica', 'Virginica', 'Virginica', 'Virginica', 'Virginica',
       'Virginica', 'Virginica', 'Virginica'], dtype=object)

In [19]:
#identify unique values of a column
df['variety'].unique()

array(['Setosa', 'Versicolor', 'Virginica'], dtype=object)

In [20]:
#sort the dataframe
df.sort_values(by=['variety','sepal.length'],ascending=[True,True])

     sepal.length  sepal.width  petal.length  petal.width    variety
13            4.3          3.0           1.1          0.1     Setosa
8             4.4          2.9           1.4          0.2     Setosa
38            4.4          3.0           1.3          0.2     Setosa
42            4.4          3.2           1.3          0.2     Setosa
41            4.5          2.3           1.3          0.3     Setosa
..            ...          ...           ...          ...        ...
117           7.7          3.8           6.7          2.2  Virginica
118           7.7          2.6           6.9          2.3  Virginica
122           7.7          2.8           6.7          2.0  Virginica
135           7.7          3.0           6.1          2.3  Virginica
131           7.9          3.8           6.4          2.0  Virginica

[150 rows x 5 columns]

In [21]:
#selection/view by row number
df[0:3]

   sepal.length  sepal.width  petal.length  petal.width variety
0           5.1          3.5           1.4          0.2  Setosa
1           4.9          3.0           1.4          0.2  Setosa
2           4.7          3.2           1.3          0.2  Setosa

<h4><b>Different selection by label options</b></h4>
<ul>
    <li>loc: works only on index</li>
    <li>iloc: works on position</li>
    <li>ix: You can get data from DataFrame without it being in the index(removed from latest version)</li>
    <li>iat: Get scalar values. It's a very fast iloc</li>
    <li>at</li>
    </ul>

In [22]:
#selection by index
print(df.loc[0:2])

#selection by index of specific lable names
print(df.loc[0:3,['variety','petal.width']])

   sepal.length  sepal.width  petal.length  petal.width variety
0           5.1          3.5           1.4          0.2  Setosa
1           4.9          3.0           1.4          0.2  Setosa
2           4.7          3.2           1.3          0.2  Setosa
  variety  petal.width
0  Setosa          0.2
1  Setosa          0.2
2  Setosa          0.2
3  Setosa          0.2

In [23]:
#selection by position
print(df.iloc[0:2])

   sepal.length  sepal.width  petal.length  petal.width variety
0           5.1          3.5           1.4          0.2  Setosa
1           4.9          3.0           1.4          0.2  Setosa

In [24]:
#selection by position between given rows as range
df.iloc[0:2,0:4]

   sepal.length  sepal.width  petal.length  petal.width
0           5.1          3.5           1.4          0.2
1           4.9          3.0           1.4          0.2

In [25]:
df.iloc[6:9,0:]

   sepal.length  sepal.width  petal.length  petal.width variety
6           4.6          3.4           1.4          0.3  Setosa
7           5.0          3.4           1.5          0.2  Setosa
8           4.4          2.9           1.4          0.2  Setosa

In [26]:
#selection by position between given rows as range
df.iloc[6:9,0:2]

   sepal.length  sepal.width
6           4.6          3.4
7           5.0          3.4
8           4.4          2.9

In [27]:
#selection by position between specific row numbers
df.iloc[[1,2,4],[0,2]]

   sepal.length  petal.length
1           4.9           1.4
2           4.7           1.3
4           5.0           1.4

In [28]:
#transpose
df.T

,0,1,2,3,4,5,6,7,8,9,...,140,141,142,143,144,145,146,147,148,149
sepal.length,5.1,4.9,4.7,4.6,5,5.4,4.6,5,4.4,4.9,...,6.7,6.9,5.8,6.8,6.7,6.7,6.3,6.5,6.2,5.9
sepal.width,3.5,3,3.2,3.1,3.6,3.9,3.4,3.4,2.9,3.1,...,3.1,3.1,2.7,3.2,3.3,3,2.5,3,3.4,3
petal.length,1.4,1.4,1.3,1.5,1.4,1.7,1.4,1.5,1.4,1.5,...,5.6,5.1,5.1,5.9,5.7,5.2,5,5.2,5.4,5.1
petal.width,0.2,0.2,0.2,0.2,0.2,0.4,0.3,0.2,0.2,0.1,...,2.4,2.3,1.9,2.3,2.5,2.3,1.9,2,2.3,1.8
variety,Setosa,Setosa,Setosa,Setosa,Setosa,Setosa,Setosa,Setosa,Setosa,Setosa,...,Virginica,Virginica,Virginica,Virginica,Virginica,Virginica,Virginica,Virginica,Virginica,Virginica

<h3><b>Boolean Indexing</b></h3>

In [29]:
#filter dataframe based on a value condition on one column
df[df['sepal.length']>7.5]

     sepal.length  sepal.width  petal.length  petal.width    variety
105           7.6          3.0           6.6          2.1  Virginica
117           7.7          3.8           6.7          2.2  Virginica
118           7.7          2.6           6.9          2.3  Virginica
122           7.7          2.8           6.7          2.0  Virginica
131           7.9          3.8           6.4          2.0  Virginica
135           7.7          3.0           6.1          2.3  Virginica

<h3><b>Basic Operations</b></h3>

In [2]:
import pandas as pd

In [3]:
date_strings = ('2017-04-01' , '2020-09-12', '2019-09-04')
pd.to_datetime(pd.Series(date_strings))

0   2017-04-01
1   2020-09-12
2   2019-09-04
dtype: datetime64[ns]

In [4]:
print(type(date_strings))

<class 'tuple'>

In [5]:
df = pd.read_csv(r"C:\Users\Stuti Singh\Downloads\tableconvert_csv_abbyek.csv")
df.rename(columns={'sepal.length':'Sepal_Length'},inplace= True)
#change all column names
df.columns('Sepal_Length','Petal_length','Sepal_width','Petal_width')
df

     Sepal_Length  sepal.width  petal.length  petal.width    variety
0             5.1          3.5           1.4          0.2     Setosa
1             4.9          3.0           1.4          0.2     Setosa
2             4.7          3.2           1.3          0.2     Setosa
3             4.6          3.1           1.5          0.2     Setosa
4             5.0          3.6           1.4          0.2     Setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

[150 rows x 5 columns]

In [4]:
#Remove duplicates
raw_data = {'first_name':['Amy', 'Amy' ,'Jason' , 'Nick' , 'Stephen','Amy'],
           'last_name':['Jackson','J','Miller','Milner','L','J'],
           'age':[42,42,36,24,24,42]}
df = pd.DataFrame(raw_data,columns=['first_name','last_name','age'])
print(df)
print('-----------------')
print(df.duplicated())
print('-----------------')
print(df.drop_duplicates())
print('-----------------')

#drop duplicates in the first name column, but take the first obs in the duplicated set.
#to return last obs of duplicate, chnage the keep option to 'last'
df.drop_duplicates(['first_name'],keep='first')

  first_name last_name  age
0        Amy   Jackson   42
1        Amy         J   42
2      Jason    Miller   36
3       Nick    Milner   24
4    Stephen         L   24
5        Amy         J   42
-----------------
0    False
1    False
2    False
3    False
4    False
5     True
dtype: bool
-----------------
  first_name last_name  age
0        Amy   Jackson   42
1        Amy         J   42
2      Jason    Miller   36
3       Nick    Milner   24
4    Stephen         L   24
-----------------

  first_name last_name  age
0        Amy   Jackson   42
2      Jason    Miller   36
3       Nick    Milner   24
4    Stephen         L   24

In [23]:
# Creating new column from existing column
df['age_plus_5'] = df['age'] + 5
df
#creating new column from elements of two columns
df['full_name'] = df['first_name'] + '_' + df['last_name']
df

#adding a list of a new column to the DataFrame
df['gender'] = pd.Series(['F','F','M','M','F','F'])
df

  first_name last_name  age  age_plus_5     full_name gender
0        Amy   Jackson   42          47   Amy_Jackson      F
1        Amy         J   42          47         Amy_J      F
2      Jason    Miller   36          41  Jason_Miller      M
3       Nick    Milner   24          29   Nick_Milner      M
4    Stephen         L   24          29     Stephen_L      F
5        Amy         J   42          47         Amy_J      F

<h3><b>Missing Data</b></h3><br>
Pandas primarily uses the value np.nan to represent missing data. It is by default not included in computations.

In [1]:
import numpy as np

In [11]:
df.iat[4,2] = 0

print("---------With NA's-------")
print(df)

print("---------After dropping NA's-----------")
# drop rows or columns having missing data
print (df.dropna())

---------With NA's-------
  first_name last_name age
0        Amy   Jackson  42
1        Amy         J  42
2      Jason    Miller  36
3       Nick    Milner  24
4    Stephen         L   0
5        Amy         J  42
---------After dropping NA's-----------
  first_name last_name age
0        Amy   Jackson  42
1        Amy         J  42
2      Jason    Miller  36
3       Nick    Milner  24
4    Stephen         L   0
5        Amy         J  42

In [14]:
type(df['age'][4])

int

<h3><b>Operations</b></h3>

In [24]:
# Return mean for each column
df.mean()

age           35.0
age_plus_5    40.0
dtype: float64

In [25]:
# Return min for each column
df.min()

first_name      Amy
last_name         J
age              24
age_plus_5       29
full_name     Amy_J
gender            F
dtype: object

In [26]:
df.max()

first_name      Stephen
last_name        Milner
age                  42
age_plus_5           47
full_name     Stephen_L
gender                M
dtype: object

In [27]:
# Return sum for each column
df.sum()

first_name                            AmyAmyJasonNickStephenAmy
last_name                                JacksonJMillerMilnerLJ
age                                                         210
age_plus_5                                                  240
full_name     Amy_JacksonAmy_JJason_MillerNick_MilnerStephen...
gender                                                   FFMMFF
dtype: object

In [28]:
# Return count for each column
df.count()

first_name    6
last_name     6
age           6
age_plus_5    6
full_name     6
gender        6
dtype: int64

In [29]:
# Return cummulative sum for each row
df.cumsum()

,first_name,last_name,age,age_plus_5,full_name,gender
0,Amy,Jackson,42,47,Amy_Jackson,F
1,AmyAmy,JacksonJ,84,94,Amy_JacksonAmy_J,FF
2,AmyAmyJason,JacksonJMiller,120,135,Amy_JacksonAmy_JJason_Miller,FFM
3,AmyAmyJasonNick,JacksonJMillerMilner,144,164,Amy_JacksonAmy_JJason_MillerNick_Milner,FFMM
4,AmyAmyJasonNickStephen,JacksonJMillerMilnerL,168,193,Amy_JacksonAmy_JJason_MillerNick_MilnerStephen_L,FFMMF
5,AmyAmyJasonNickStephenAmy,JacksonJMillerMilnerLJ,210,240,Amy_JacksonAmy_JJason_MillerNick_MilnerStephen...,FFMMFF

<h3><b>Applying function to element, column or DataFrame</b></h3>

<h3><b>Apply</b></h3>

In [30]:
# It applies a function along any axis of DataFrame
df.apply(np.cumsum)

,first_name,last_name,age,age_plus_5,full_name,gender
0,Amy,Jackson,42,47,Amy_Jackson,F
1,AmyAmy,JacksonJ,84,94,Amy_JacksonAmy_J,FF
2,AmyAmyJason,JacksonJMiller,120,135,Amy_JacksonAmy_JJason_Miller,FFM
3,AmyAmyJasonNick,JacksonJMillerMilner,144,164,Amy_JacksonAmy_JJason_MillerNick_Milner,FFMM
4,AmyAmyJasonNickStephen,JacksonJMillerMilnerL,168,193,Amy_JacksonAmy_JJason_MillerNick_MilnerStephen_L,FFMMF
5,AmyAmyJasonNickStephenAmy,JacksonJMillerMilnerLJ,210,240,Amy_JacksonAmy_JJason_MillerNick_MilnerStephen...,FFMMFF

<b>Map</b> : It iterates over each element of a series.

In [31]:
df['age'].map(lambda x: 1+x) #this will add a constant 1 to each element of column1

0    43
1    43
2    37
3    25
4    25
5    43
Name: age, dtype: int64

<b>ApplyMap</b> : This helps to apply a function to each element of DataFrame.

In [ ]:
func = lambda x : x+1
# all columns of dataframe should be numeric type as we are trying to perform addition operation
df_filtered = df.iat[:,2:4]
print("--------Before applymap----------")
print(df_filtered)
print("--------After applymap-----------")
print(df_filtered.applymap(func))

<h3><b>Merge</b></h3><br>
Pandas has a rich functionality such as set operations of algebra and join operations of relations database, for combining multiple series, DataFrames

In [35]:
data = {
        'emp_id': ['1', '2', '3', '4', '5'],
        'first_name': ['Jason', 'Andy', 'Allen', 'John', 'Amy'], 
        'last_name': ['Larkin', 'Jacob', 'A', 'AA', 'Jackson']}
df_1 = pd.DataFrame(data, columns = ['emp_id', 'first_name', 'last_name'])
print("----df_1----")
print(df_1)

----df_1----
  emp_id first_name last_name
0      1      Jason    Larkin
1      2       Andy     Jacob
2      3      Allen         A
3      4       John        AA
4      5        Amy   Jackson

In [36]:
data = {
        'emp_id': ['4', '5', '6', '7'],
        'first_name': ['James', 'Shize', 'Kim', 'Jose'], 
        'last_name': ['Alexander', 'Suma', 'Mike', 'G']}
df_2 = pd.DataFrame(data, columns = ['emp_id', 'first_name', 'last_name'])
print(df_2)

  emp_id first_name  last_name
0      4      James  Alexander
1      5      Shize       Suma
2      6        Kim       Mike
3      7       Jose          G

In [38]:
# Using concat
df = pd.concat([df_1, df_2])
print (df)

# Using append
print(df_1.append(df_2))

  emp_id first_name  last_name
0      1      Jason     Larkin
1      2       Andy      Jacob
2      3      Allen          A
3      4       John         AA
4      5        Amy    Jackson
0      4      James  Alexander
1      5      Shize       Suma
2      6        Kim       Mike
3      7       Jose          G
  emp_id first_name  last_name
0      1      Jason     Larkin
1      2       Andy      Jacob
2      3      Allen          A
3      4       John         AA
4      5        Amy    Jackson
0      4      James  Alexander
1      5      Shize       Suma
2      6        Kim       Mike
3      7       Jose          G

In [39]:
# Join the two dataframes along columns
print(pd.concat([df_1, df_2], axis=1))

  emp_id first_name last_name emp_id first_name  last_name
0      1      Jason    Larkin      4      James  Alexander
1      2       Andy     Jacob      5      Shize       Suma
2      3      Allen         A      6        Kim       Mike
3      4       John        AA      7       Jose          G
4      5        Amy   Jackson    NaN        NaN        NaN

In [52]:
print(pd.concat([df_1, df_2], axis=0))

  emp_id first_name  last_name
0      1      Jason     Larkin
1      2       Andy      Jacob
2      3      Allen          A
3      4       John         AA
4      5        Amy    Jackson
0      4      James  Alexander
1      5      Shize       Suma
2      6        Kim       Mike
3      7       Jose          G

In [40]:
# Merge two dataframes based on the emp_id value 
#in this case only the emp_id's present in both table will be joined
print (pd.merge(df_1, df_2, on='emp_id'))

  emp_id first_name_x last_name_x first_name_y last_name_y
0      4         John          AA        James   Alexander
1      5          Amy     Jackson        Shize        Suma

<h3><b>Join (SQL Style Merges)</b></h3><br>
<b>Left join</b> produces an output table containing complete set of records from Table A, and only the matching records in Table B. If there is no match, the right side will contain null.

Note: Note that you can suffixe to avoid duplicate, if not provided it will automatically add x to the Table A and y to Table B

In [41]:
# Left join
print (pd.merge(df_1, df_2, on='emp_id', how='left'))

# Add a suffix to duplicate column names of both table
print(pd.merge(df_1, df_2, on='emp_id', how='left', suffixes=('_left', '_right')))

  emp_id first_name_x last_name_x first_name_y last_name_y
0      1        Jason      Larkin          NaN         NaN
1      2         Andy       Jacob          NaN         NaN
2      3        Allen           A          NaN         NaN
3      4         John          AA        James   Alexander
4      5          Amy     Jackson        Shize        Suma
  emp_id first_name_left last_name_left first_name_right last_name_right
0      1           Jason         Larkin              NaN             NaN
1      2            Andy          Jacob              NaN             NaN
2      3           Allen              A              NaN             NaN
3      4            John             AA            James       Alexander
4      5             Amy        Jackson            Shize            Suma

<b>Right join</b> - Right join produces an output table with complete set of records from Table B, and matching records from Table A. If there is no match, the left side will contain null.

In [42]:
# right join
print (pd.merge(df_1, df_2, on='emp_id', how='right'))

  emp_id first_name_x last_name_x first_name_y last_name_y
0      4         John          AA        James   Alexander
1      5          Amy     Jackson        Shize        Suma
2      6          NaN         NaN          Kim        Mike
3      7          NaN         NaN         Jose           G

<h3><b>Inner Join</b></h3><br>
Inner join produces an output talbe that contains only the set of records that match in both Table A and Table B

In [43]:
print (pd.merge(df_1, df_2, on='emp_id', how='inner'))

  emp_id first_name_x last_name_x first_name_y last_name_y
0      4         John          AA        James   Alexander
1      5          Amy     Jackson        Shize        Suma

<h3><b>Outer Join</b></h3>

Also known as full outer join will produce an output table that contains set of all records in Table A and Table B, with matching records from both sides. If there is no match, the missing side will contain null

In [45]:
print (pd.merge(df_1, df_2, on='emp_id', how='outer'))

  emp_id first_name_x last_name_x first_name_y last_name_y
0      1        Jason      Larkin          NaN         NaN
1      2         Andy       Jacob          NaN         NaN
2      3        Allen           A          NaN         NaN
3      4         John          AA        James   Alexander
4      5          Amy     Jackson        Shize        Suma
5      6          NaN         NaN          Kim        Mike
6      7          NaN         NaN         Jose           G

In [46]:
# Merge based on indexes
pd.merge(df_1, df_2, right_index=True, left_index=True)

  emp_id_x first_name_x last_name_x emp_id_y first_name_y last_name_y
0        1        Jason      Larkin        4        James   Alexander
1        2         Andy       Jacob        5        Shize        Suma
2        3        Allen           A        6          Kim        Mike
3        4         John          AA        7         Jose           G

<h3><b>Grouping</b></h3>

Pandas “group by” will enable us to achieve the below:
<ul>
    <li>Applying an aggregation function to each group independently</li>
    <li>Based on some criteria split the data into groups</li>
    <li>Combining the results of the "group by" into a data structure</li>
</ul>

In [47]:
df = pd.DataFrame({'Name' : ['jack', 'jane', 'jack', 'jane', 'jack', 'jane', 'jack', 'jane'],
                   'State' : ['SFO', 'SFO', 'NYK', 'CA', 'NYK', 'NYK', 'SFO', 'CA'],
                   'Grade':['A','A','B','A','C','B','C','A'],
                   'Age' : np.random.uniform(24, 50, size=8),
                   'Salary' : np.random.uniform(3000, 5000, size=8),})

# Note that the columns are ordered automatically in their alphabetic order
# for custom order please use below code
# df = pd.DataFrame(data, columns = ['Name', 'State', 'Age','Salary'])
print (df)

   Name State Grade        Age       Salary
0  jack   SFO     A  32.767576  3583.538819
1  jane   SFO     A  33.769683  4745.946786
2  jack   NYK     B  34.355378  3327.363359
3  jane    CA     A  27.977563  3439.782858
4  jack   NYK     C  31.524457  3604.947263
5  jane   NYK     B  48.541779  4705.486275
6  jack   SFO     C  24.318623  3497.293954
7  jane    CA     A  47.024569  3716.531252

In [48]:
df.groupby('Name').sum()

             Age        Salary
Name
jack  122.966034  14013.143396
jane  157.313594  16607.747171

In [49]:
# Find max age and salary by Name / State
# You can use all aggregate functions such as min, max, mean, count, cumsum
print (df.groupby(['Name','State']).max())

           Grade        Age       Salary
Name State
jack NYK       C  34.355378  3604.947263
     SFO       C  32.767576  3583.538819
jane CA        A  47.024569  3716.531252
     NYK       B  48.541779  4705.486275
     SFO       A  33.769683  4745.946786

<h3><b>Pivot Tables</b></h3>

Pandas provides a function 'pivot_table' to create MS-Excel spreadsheet style pivot table. It can take following arguments:
<ul>
    <li>data: DataFrame object</li>
    <li>values: column to aggregate</li>
    <li>index: row labels</li>
    <li>columns: column labels</li>
    <li>aggfunc: aggregation function to be used on values, default is NumPy.mean</li>
    </ul>

In [50]:
# by state and name find mean age for each grade
print (pd.pivot_table(df, values='Age', index=['State', 'Name'], columns=['Grade']))

Grade               A          B          C
State Name
CA    jane  37.501066        NaN        NaN
NYK   jack        NaN  34.355378  31.524457
      jane        NaN  48.541779        NaN
SFO   jack  32.767576        NaN  24.318623
      jane  33.769683        NaN        NaN

<b>DataFrame.value_counts()</b> : count of unique values from a col

In [16]:
df = pd.DataFrame({'length': [2,5,5,6,8,5], 'breadth':[7,3,2,9,3,3]})

In [17]:
df

   length  breadth
0       2        7
1       5        3
2       5        2
3       6        9
4       8        3
5       5        3

In [21]:
df['length'].value_counts(sort= False)

8    1
2    1
5    3
6    1
Name: length, dtype: int64

In [24]:
df = pd.DataFrame({'length': [2,5,5,6,8,5], 'breadth':[7,3,2,9,3,3], 'falcon':['car','car','bike','scooty','bike','bicycle']})

In [25]:
df['length'].value_counts(sort= False)

8    1
2    1
5    3
6    1
Name: length, dtype: int64

In [26]:
df['falcon'].value_counts(sort= False)

bicycle    1
bike       2
scooty     1
car        2
Name: falcon, dtype: int64